[
    {
        "title": "BORIS YAKOVLEVICH LIVSHITS",
        "description": "Conspiracy to Defraud the United States; Conspiracy to Violate the International Emergency Economic Powers Act (IEEPA); Bank Fraud Conspiracy; Wire Fraud Conspiracy; Wire Fraud; Money Laundering Conspiracy; Money Laundering; Conspiracy to Violate the Export Control Reform Act (ECRA); Smuggling Goods from the United States; Failure to File Electronic Export Information",
        "details": null,
        "place_of_birth": "Leningrad, Russia",
        "sex": "Male",
        "dates_of_birth_used": [
            "May 9, 1970"
        ]
    },
    {
        "title": "JESUS DE LA CRUZ - LYNN, MASSACHUSETTS",
        "description": "September 28, 1996\r\nLynn, Massachusetts",
        "details": "<p>Jesus de la Cruz was last seen on September 28, 1996, walking on Park Street near his residence in Lynn, Massachusetts. He was six years old at the time of his disappearance and has not been seen since. De la Cruz has a scar above his left eye, birthmarks on his left calf and the left side of his forehead, and his left ear is pierced. He was last seen wearing a white t-shirt, blue jeans, and brown and yellow boots.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "MARY ALETA \"MOLLY\" SPARKS",
        "description": "Homicide Victim\r\nAlgodones, New Mexico\r\nJuly 23-24, 1975",
        "details": "<p>The Federal Bureau of Investigation's Albuquerque Field Office, along with the Sandoval County Sheriff's Office in New Mexico, are seeking the public's assistance in identifying the circumstances surrounding the homicide of Mary Aleta \"Molly\" Sparks in 1975.</p>\r\n<p> </p>\r\n<p>Sparks, 21, was last seen on July 23, 1975, between 9:00 p.m. and 11:00 p.m. at Rosa's Cantina in Algodones, New Mexico, where she was to meet with friends and fellow members of an all-female rugby team.</p>\r\n<p> </p>\r\n<p>Her body was found in a drainage ditch west of the bar on July 24, 1975. The cause of death was blunt force trauma to her head and neck, with possible strangulation.</p>",
        "place_of_birth": "Albuquerque, New Mexico",
        "sex": "Female",
        "dates_of_birth_used": [
            "March 29, 1954"
        ]
    },
    {
        "title": "SUSAN GAIL CARTER",
        "description": "August 8, 2000\r\nBeckley, West Virginia",
        "details": "<p>Susan Gail Carter was last seen in Beckley, West Virginia, on August 8, 2000, with her daughter, <a data-linktype=\"external\" data-val=\"https://www.fbi.gov/wanted/kidnap/natasha-alex-carter\" href=\"https://www.fbi.gov/wanted/kidnap/natasha-alex-carter\" data-urltype=\"/view\">Natasha \"Alex\" Carter</a>.  They may have traveled out of state and left West Virginia.  Susan had been involved in a contentious battle over Natasha's custody with the child's father and had told him he would never see his daughter again.  Natasha's grandmother believed the child was afraid of her mother and did not want to live with her.  Susan may be using the alias Susan Gail Carter Webb and she may alter her appearance. </p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Female",
        "dates_of_birth_used": [
            "March 8, 1959"
        ]
    },
    {
        "title": "AARON PAUL VICTORY",
        "description": "Escape; Felon in Possession of  Firearm and Ammunition; Possession of a Stolen Firearm",
        "details": null,
        "place_of_birth": "Oklahoma",
        "sex": "Male",
        "dates_of_birth_used": [
            "January 28, 1979",
            "July 28, 1979",
            "January 28, 1969"
        ]
    },
    {
        "title": "BRYAN MATTHEW MCGEHRIN - TANEYTOWN, MARYLAND",
        "description": "October 25, 2019\r\nTaneytown, Maryland",
        "details": "<p>Bryan McGehrin was last seen at his mother’s residence on October 25, 2019, in Taneytown, Maryland.  When he left her residence, he did not say where he was going.  He was released from jail in Hagerstown, Maryland, two days prior.  McGehrin does not have a cell phone but would historically make contact with his family using his friends’ phones.  McGehrin has depression and was not taking medication for it.  He was supposed to attend a probation meeting but missed it. If you have any information regarding this investigation, please contact the Westminster Police Department.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "JOHN DOE - WATERLOO TOWNSHIP, MICHIGAN",
        "description": "August 30, 1978 \r\nWaterloo Township, Michigan",
        "details": "<p>On Wednesday, August 30, 1978, the skeletal remains of a black male dressed in women’s clothing and a wig were found bound and wrapped in plastic trash bags. The male had a right shoulder surgical implantation of two large staples into the lateral aspect of greater tubercle of the right humerus and a 32 mm (1 ¼”) screw into the anterior border of glenoid fossa of the right scapula. He was missing 10 teeth to include his two upper front teeth and there was evidence of a healed nasal fracture. The cause of death could not be determined; however, based on how the body was found this case is considered a homicide. The Michigan State Police (MSP) Violent Crimes Unit (VCU) is requesting assistance with identifying this male and any similar cases.</p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "MITCHELL TODD HEIN - INDIO, CALIFORNIA",
        "description": "Indio, California\r\nFebruary 1, 1983",
        "details": "<p>Jefferson County Sheriff’s Office in Colorado is seeking assistance from the public to locate Mitchell Todd Hein. Hein visited family in Jefferson County, Colorado, in December of 1982 and abruptly left in January or February of 1983 without saying goodbye to anyone. He was carrying his clothes and belongings in a black trash bag. According to a friend, Hein showed up in Clinton, Oklahoma, and then in early March 1983, Hein hitched a ride with the friend's father to California. They stopped for the night in Indio, California. Hein left the hotel room and has not been seen or heard from since. It was reported that Hein had thrown away his driver's license and social security card and may have had no form of identification on him.</p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "DHULFIQAR KAREEM MSEER",
        "description": "Homicide Victim\r\nPortland, Oregon\r\nDecember 11, 2020",
        "details": "<p>On December 11, 2020, 23-year-old Dhulfiqar Kareem Mseer was working as an Uber driver.  Shortly before midnight, he arrived in the area of NE Stafford Street and NE 11th Avenue in Portland, Oregon, to pick up a fare.  He was shot by multiple subjects who fired approximately 70 rounds.  He died several days later.  The subjects got into two cars before leaving the area.  One of the cars is believed to be a VW Eos.  Shell casings recovered at the scene have been matched to casings found at other gang-involved shootings in the area.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": null,
        "dates_of_birth_used": null
    },
    {
        "title": "FREDERICK ARIAS",
        "description": "Unlawful Flight to Avoid Prosecution - Conspiracy; Fraudulent Schemes and Artifices; Money Laundering in the First Degree; Theft (10 Counts); Illegal Control of an Enterprise (Two Counts); Forgery; Fraudulent Schemes and Practices; Failure to Appear",
        "details": null,
        "place_of_birth": "New York",
        "sex": "Male",
        "dates_of_birth_used": [
            "September 13, 1966"
        ]
    },
    {
        "title": "RANDY STEWART DORAN - NEW ORLEANS, LOUISIANA",
        "description": "April 1, 1978\r\nNew Orleans, Louisiana",
        "details": "<p>Randy Stewart Doran left his family’s Los Angeles, California, residence in early 1978. His last communication with family members was in early April 1978 when he called an aunt, stating he was working on a shipping dock (possibly on the SS President riverboat) in New Orleans, Louisiana. Prior to his disappearance, he sent a postcard to his aunt from New Orleans saying he was doing fine. He has never been heard from again.</p>\r\n<p> </p>\r\n<p>Doran was known to hitchhike, traveling across the country from California to Florida. He was a U.S. Marine Corps veteran, an avid guitar player, and liked to write short stories and poetry. He also carried a small pocket Bible with him. Fingerprints are available for comparison, and DNA from family members is in CODIS.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "JAMES S. RULAND - NORTH FOND du LAC, WISCONSIN",
        "description": "October 26, 1995\r\nNorth Fond du Lac, Wisconsin",
        "details": "<p>On Thursday, October 26, 1995, James S. Ruland was last seen hitchhiking in North Fond du Lac, Wisconsin. Nine days later, he was reported missing by his sister. On November 14, 1995, Ruland’s white Dodge Aires station wagon was recovered from the Stretch Truck Stop near North Fond du Lac. The keys were in the ignition and Ruland’s personal possessions were in the cargo area.</p>\r\n<p>Ruland sustained a severe head injury when he was young which required a shunt implant. The initial shunt failed, necessitating a second shunt. The implants required “bilateral burr holes” so the shunts could pass through his skull. Fond du Lac Sheriff’s Office is requesting assistance with locating Ruland.</p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": null
    },
    {
        "title": "MARY JOHNSON (DAVIS)",
        "description": "November 25, 2020\r\nTulalip Reservation\r\nWashington State",
        "details": "<p>The Federal Bureau of Investigation's Seattle Field Office and the Tulalip Tribal Police are investigating the disappearance of Mary Johnson (Davis), last seen November 25, 2020, walking east on Firetrail Road on the Tulalip Reservation in Washington State.  Mary was traveling to a friend’s house and never arrived.  She was reported missing December 9, 2020. </p>\r\n<p> </p>",
        "place_of_birth": "Washington State",
        "sex": "Female",
        "dates_of_birth_used": [
            "August 31, 1981"
        ]
    },
    {
        "title": "YEVGYENIY IGORYEVICH POLYANIN",
        "description": "Conspiracy to Commit Fraud and Related Activity in Connection with Computers; Intentional Damage to a Protected Computer; Conspiracy to Commit Money Laundering",
        "details": null,
        "place_of_birth": "Russia",
        "sex": "Male",
        "dates_of_birth_used": [
            "March 4, 1993"
        ]
    },
    {
        "title": "HEATHER MAE KELLEY",
        "description": "December 10, 2022\r\nKalamazoo, Michigan",
        "details": "<p>The FBI's Detroit Field Office, along with the Kalamazoo County Sheriff's Office and the Portage Department of Public Safety in Michigan, is requesting the public's help in locating a missing person.  Heather Mae Kelley is a resident of the City of Portage, Michigan, and has been missing since December 10, 2022.  There is evidence to suggest that she may have been the victim of a homicide.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Female",
        "dates_of_birth_used": [
            "June 18, 1987"
        ]
    },
    {
        "title": "DARASY S. CHHIM",
        "description": "Conspiracy to Distribute and to Possess with Intent to Distribute Heroin, 500 Grams or More of Cocaine, Cocaine Base, 40 Grams or More of Fentanyl, 500 Grams or More of Methamphetamine, and MDMA",
        "details": null,
        "place_of_birth": "California",
        "sex": "Male",
        "dates_of_birth_used": [
            "August 13, 1985"
        ]
    },
    {
        "title": "SALOME FLORES APODACA",
        "description": "Conspiracy to Distribute Five Kilograms or More of Cocaine, Fifty Grams or More of Methamphetamine, One Kilogram or More of Heroin, and One Thousand Kilograms or More of Marijuana for Importation into the United States; Use of a Firearm",
        "details": null,
        "place_of_birth": "Sinaloa, Mexico",
        "sex": "Male",
        "dates_of_birth_used": [
            "October 23, 1962"
        ]
    },
    {
        "title": "TRUNG DUC LU",
        "description": "Conspiracy to Commit Kidnapping; Kidnapping (3 Counts); Interstate Travel in Aid of Racketeering; Conspiracy to Collect an Extension of Credit by Extortionate Means; Collection of an Extension of Credit by Extortionate Means; Conspiracy to Distribute Marijuana; Aiding and Abetting",
        "details": null,
        "place_of_birth": "Republic of Vietnam",
        "sex": "Male",
        "dates_of_birth_used": [
            "October 1, 1980",
            "December 2, 1979",
            "December 9, 1979",
            "November 13, 1980",
            "October 1, 1981",
            "October 10, 1982"
        ]
    },
    {
        "title": "ISIAH TERRELL BILLY",
        "description": "Homicide Victim\r\nShiprock, New Mexico\r\nOctober 5, 2020",
        "details": "<p>The FBI's Albuquerque Field Office, Farmington Resident Agency in New Mexico is seeking the public's assistance in finding the person(s) responsible for the death of Isiah Terrell Billy, who lived in Shiprock, New Mexico, on the Navajo Nation.</p>\r\n<p> </p>\r\n<p>On October 5, 2020, Billy was found deceased in a wash east of the Sinclair gas station near mile marker 23 on U.S. Highway 64, in Shiprock, New Mexico.  The cause of death was ruled to be strangulation.</p>\r\n<p> </p>",
        "place_of_birth": null,
        "sex": "Male",
        "dates_of_birth_used": [
            "October 4, 1990"
        ]
    },
    {
        "title": "EDWIN ERNESTO CEDILLOS-RODRIGUEZ",
        "description": "Conspiracy to Provide and Conceal Material Support and Resources to Terrorists; Narco-Terrorism Conspiracy; Racketeering Conspiracy",
        "details": null,
        "place_of_birth": "Cuscatancingo, San Salvador, El Salvador",
        "sex": "Male",
        "dates_of_birth_used": [
            "September 2, 1987"
        ]
    }
]